#include <iostream> // Приготовление в Миледи книва вперед на и науголь
#include <string> // Приготовление в Миледи книва для делания со словеса

int
main()
{
  std::string
    name; // Благовещение переменная словесьного вида для имени прейца
  std::cin >> name; // Чтение имени прейца с помощью вида боярина
                    // ввиду (юспам) топора (клавиатура)

  std::cout << "Добры день от ноши "
            << name; // Вывод применения князьского аката со именем прейца

  return 0; // Отмыкание нуля для знаменования налиго скончания труда
}
